In [1]:
import pandas as pd,numpy as np

In [2]:
my_dict={'name':['xavier','ann','jana','yi','rabin','amal','nori'],'city':['mexico city',
        'toronto','prague','shanghai','manchester','cairo','osaka'],'age':[41,28,33,34,38,31,37],
         'py-score':[88,79,81,80,68,61,84]}

In [3]:
my_dict

{'name': ['xavier', 'ann', 'jana', 'yi', 'rabin', 'amal', 'nori'],
 'city': ['mexico city',
  'toronto',
  'prague',
  'shanghai',
  'manchester',
  'cairo',
  'osaka'],
 'age': [41, 28, 33, 34, 38, 31, 37],
 'py-score': [88, 79, 81, 80, 68, 61, 84]}

In [4]:
df=pd.DataFrame(my_dict,index=range(101,108))

In [5]:
df

       name         city  age  py-score
101  xavier  mexico city   41        88
102     ann      toronto   28        79
103    jana       prague   33        81
104      yi     shanghai   34        80
105   rabin   manchester   38        68
106    amal        cairo   31        61
107    nori        osaka   37        84

In [6]:
df.dtypes

name        object
city        object
age          int64
py-score     int64
dtype: object

In [13]:
df['py-score']=df['py-score'].astype(float)

In [14]:
df.dtypes

name         object
city         object
age           int64
py-score    float64
dtype: object

In [15]:
df2=df.copy()

In [16]:
df2

       name         city  age  py-score
101  xavier  mexico city   41      88.0
102     ann      toronto   28      79.0
103    jana       prague   33      81.0
104      yi     shanghai   34      80.0
105   rabin   manchester   38      68.0
106    amal        cairo   31      61.0
107    nori        osaka   37      84.0

In [17]:
df2.values

array([['xavier', 'mexico city', 41, 88.0],
       ['ann', 'toronto', 28, 79.0],
       ['jana', 'prague', 33, 81.0],
       ['yi', 'shanghai', 34, 80.0],
       ['rabin', 'manchester', 38, 68.0],
       ['amal', 'cairo', 31, 61.0],
       ['nori', 'osaka', 37, 84.0]], dtype=object)

In [18]:
df2.index

RangeIndex(start=101, stop=108, step=1)

In [21]:
ind=df.index

In [23]:
list(ind)

[101, 102, 103, 104, 105, 106, 107]

In [24]:
df.columns

Index(['name', 'city', 'age', 'py-score'], dtype='object')

In [29]:
df.count()

name        7
city        7
age         7
py-score    7
dtype: int64

In [30]:
df2['name']

101    xavier
102       ann
103      jana
104        yi
105     rabin
106      amal
107      nori
Name: name, dtype: object

In [32]:
df2['city']

101    mexico city
102        toronto
103         prague
104       shanghai
105     manchester
106          cairo
107          osaka
Name: city, dtype: object

In [33]:
df2[['name','city']]

       name         city
101  xavier  mexico city
102     ann      toronto
103    jana       prague
104      yi     shanghai
105   rabin   manchester
106    amal        cairo
107    nori        osaka

In [37]:
df2[:1]

       name         city  age  py-score
101  xavier  mexico city   41      88.0

In [38]:
df2['name'][:3]

101    xavier
102       ann
103      jana
Name: name, dtype: object

In [39]:
df2.columns.name='Emp_details'
df2.index.name='emp_id'

In [40]:
df2

Emp_details    name         city  age  py-score
emp_id
101          xavier  mexico city   41      88.0
102             ann      toronto   28      79.0
103            jana       prague   33      81.0
104              yi     shanghai   34      80.0
105           rabin   manchester   38      68.0
106            amal        cairo   31      61.0
107            nori        osaka   37      84.0

In [43]:
df2['name']['104']='Yi'

/tmp/ipykernel_5834/1779195321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['name']['104']='Yi'

In [45]:
df2['name'][102]='Ann'

/tmp/ipykernel_5834/1367134333.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['name'][102]='Ann'

In [46]:
df2

Emp_details    name         city  age  py-score
emp_id
101          xavier  mexico city   41      88.0
102             Ann      toronto   28      79.0
103            jana       prague   33      81.0
104              Yi     shanghai   34      80.0
105           rabin   manchester   38      68.0
106            amal        cairo   31      61.0
107            nori        osaka   37      84.0

In [47]:
df2['ratings']=4

In [48]:
df2

Emp_details    name         city  age  py-score  ratings
emp_id
101          xavier  mexico city   41      88.0        4
102             Ann      toronto   28      79.0        4
103            jana       prague   33      81.0        4
104              Yi     shanghai   34      80.0        4
105           rabin   manchester   38      68.0        4
106            amal        cairo   31      61.0        4
107            nori        osaka   37      84.0        4

In [54]:
df2.shape

(7, 5)

In [70]:
del df2['ratings']

In [79]:
rate=np.array(np.random.randint(0,5,7),dtype=int)

In [80]:
rate

array([1, 1, 2, 4, 4, 4, 4])

In [81]:
df2['ratings']=rate

In [82]:
df2

Emp_details    name         city  age  py-score  ratings
emp_id
101          xavier  mexico city   41      88.0        1
102             Ann      toronto   28      79.0        1
103            jana       prague   33      81.0        2
104              Yi     shanghai   34      80.0        4
105           rabin   manchester   38      68.0        4
106            amal        cairo   31      61.0        4
107            nori        osaka   37      84.0        4

In [ ]:
df2.insert(2,'category',tuple('abdaecb'))

In [84]:
df2

Emp_details    name         city category  age  py-score  ratings
emp_id
101          xavier  mexico city        a   41      88.0        1
102             Ann      toronto        b   28      79.0        1
103            jana       prague        d   33      81.0        2
104              Yi     shanghai        a   34      80.0        4
105           rabin   manchester        e   38      68.0        4
106            amal        cairo        c   31      61.0        4
107            nori        osaka        b   37      84.0        4

In [90]:
df2['name'].isin(['Ann','jana'])

emp_id
101    False
102     True
103     True
104    False
105    False
106    False
107    False
Name: name, dtype: bool

In [94]:
df2.name

emp_id
101    xavier
102       Ann
103      jana
104        Yi
105     rabin
106      amal
107      nori
Name: name, dtype: object

In [95]:
my_dict2={'name':{1:'john',2:'marie',3:'luna',4:'peter'},'age':{1:27,2:22,3:24,4:29},
         'sex':{1:'Male',2:'Female',3:'Female',4:"Male"},'married':{3:'Yes',4:'No'}}

In [96]:
my_dict2

{'name': {1: 'john', 2: 'marie', 3: 'luna', 4: 'peter'},
 'age': {1: 27, 2: 22, 3: 24, 4: 29},
 'sex': {1: 'Male', 2: 'Female', 3: 'Female', 4: 'Male'},
 'married': {3: 'Yes', 4: 'No'}}

In [97]:
df_n=pd.DataFrame(my_dict2)

In [98]:
df_n

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [99]:
df_n.T

            1       2       3      4
name     john   marie    luna  peter
age        27      22      24     29
sex      Male  Female  Female   Male
married   NaN     NaN     Yes     No

In [102]:
ser=pd.Series(np.arange(30,50,5),index=[np.random.randint(2,20,4)],dtype=int)

In [103]:
ser

6     30
3     35
16    40
8     45
dtype: int64

In [104]:
ser.idxmax()
# last index of ser

(8,)

In [105]:
ser.idxmin()
# first index of ser

(6,)

In [108]:
df_n.reindex([4,3,2,1])

    name  age     sex married
4  peter   29    Male      No
3   luna   24  Female     Yes
2  marie   22  Female     NaN
1   john   27    Male     NaN

In [109]:
df_n

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [114]:
pd.date_range('2018/03/22' ,periods=10,tz='Asia/tokyo')

DatetimeIndex(['2018-03-22 00:00:00+09:00', '2018-03-23 00:00:00+09:00',
               '2018-03-24 00:00:00+09:00', '2018-03-25 00:00:00+09:00',
               '2018-03-26 00:00:00+09:00', '2018-03-27 00:00:00+09:00',
               '2018-03-28 00:00:00+09:00', '2018-03-29 00:00:00+09:00',
               '2018-03-30 00:00:00+09:00', '2018-03-31 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Tokyo]', freq='D')

In [115]:
df_n

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [116]:
df_n.fillna(method='bfill',limit=2)

    name  age     sex married
1   john   27    Male     Yes
2  marie   22  Female     Yes
3   luna   24  Female     Yes
4  peter   29    Male      No

In [117]:
df_n.drop([4])

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes

In [118]:
df_n.drop(['married'],axis=1)

    name  age     sex
1   john   27    Male
2  marie   22  Female
3   luna   24  Female
4  peter   29    Male

In [119]:
df_n.drop(['married','age'],axis=1)

    name     sex
1   john    Male
2  marie  Female
3   luna  Female
4  peter    Male

In [120]:
df_n.drop(columns=['married','age'],index=[3,4])

    name     sex
1   john    Male
2  marie  Female

In [121]:
df

       name         city  age  py-score
101  xavier  mexico city   41      88.0
102     ann      toronto   28      79.0
103    jana       prague   33      81.0
104      yi     shanghai   34      80.0
105   rabin   manchester   38      68.0
106    amal        cairo   31      61.0
107    nori        osaka   37      84.0

In [122]:
df2

Emp_details    name         city category  age  py-score  ratings
emp_id
101          xavier  mexico city        a   41      88.0        1
102             Ann      toronto        b   28      79.0        1
103            jana       prague        d   33      81.0        2
104              Yi     shanghai        a   34      80.0        4
105           rabin   manchester        e   38      68.0        4
106            amal        cairo        c   31      61.0        4
107            nori        osaka        b   37      84.0        4

In [123]:
df+df2

     age  category                    city          name  py-score  ratings
101   82       NaN  mexico citymexico city  xavierxavier     176.0      NaN
102   56       NaN          torontotoronto        annAnn     158.0      NaN
103   66       NaN            pragueprague      janajana     162.0      NaN
104   68       NaN        shanghaishanghai          yiYi     160.0      NaN
105   76       NaN    manchestermanchester    rabinrabin     136.0      NaN
106   62       NaN              cairocairo      amalamal     122.0      NaN
107   74       NaN              osakaosaka      norinori     168.0      NaN

In [124]:
df.age+df2.age

101    82
102    56
103    66
104    68
105    76
106    62
107    74
Name: age, dtype: int64

In [125]:
ser

6     30
3     35
16    40
8     45
dtype: int64

In [130]:
df.age-ser[6]

101    11
102    -2
103     3
104     4
105     8
106     1
107     7
Name: age, dtype: int64

In [134]:
df.sum()

name                             xavierannjanayirabinamalnori
city        mexico citytorontopragueshanghaimanchestercair...
age                                                       242
py-score                                                541.0
dtype: object

In [135]:
df.sum(numeric_only=True)

age         242.0
py-score    541.0
dtype: float64

In [136]:
df.mean(numeric_only=True)

age         34.571429
py-score    77.285714
dtype: float64

In [139]:
df.describe(include='all')

          name         city        age   py-score
count        7            7   7.000000   7.000000
unique       7            7        NaN        NaN
top     xavier  mexico city        NaN        NaN
freq         1            1        NaN        NaN
mean       NaN          NaN  34.571429  77.285714
std        NaN          NaN   4.429339   9.446592
min        NaN          NaN  28.000000  61.000000
25%        NaN          NaN  32.000000  73.500000
50%        NaN          NaN  34.000000  80.000000
75%        NaN          NaN  37.500000  82.500000
max        NaN          NaN  41.000000  88.000000

In [140]:
df.tail(2)

     name   city  age  py-score
106  amal  cairo   31      61.0
107  nori  osaka   37      84.0

In [141]:
df.head(2)

       name         city  age  py-score
101  xavier  mexico city   41      88.0
102     ann      toronto   28      79.0

In [143]:
df.sort_index(ascending=False,)

       name         city  age  py-score
107    nori        osaka   37      84.0
106    amal        cairo   31      61.0
105   rabin   manchester   38      68.0
104      yi     shanghai   34      80.0
103    jana       prague   33      81.0
102     ann      toronto   28      79.0
101  xavier  mexico city   41      88.0

In [145]:
df.sort_values(by='name',)

       name         city  age  py-score
106    amal        cairo   31      61.0
102     ann      toronto   28      79.0
103    jana       prague   33      81.0
107    nori        osaka   37      84.0
105   rabin   manchester   38      68.0
101  xavier  mexico city   41      88.0
104      yi     shanghai   34      80.0

In [146]:
df.sort_values(by='name',ascending=False)

       name         city  age  py-score
104      yi     shanghai   34      80.0
101  xavier  mexico city   41      88.0
105   rabin   manchester   38      68.0
107    nori        osaka   37      84.0
103    jana       prague   33      81.0
102     ann      toronto   28      79.0
106    amal        cairo   31      61.0

In [147]:
df.sort_values(by='age')

       name         city  age  py-score
102     ann      toronto   28      79.0
106    amal        cairo   31      61.0
103    jana       prague   33      81.0
104      yi     shanghai   34      80.0
107    nori        osaka   37      84.0
105   rabin   manchester   38      68.0
101  xavier  mexico city   41      88.0

In [148]:
ser.rank()

6     1.0
3     2.0
16    3.0
8     4.0
dtype: float64

In [149]:
df.rank()

     name  city  age  py-score
101   6.0   3.0  7.0       7.0
102   2.0   7.0  1.0       3.0
103   3.0   5.0  3.0       5.0
104   7.0   6.0  4.0       4.0
105   5.0   2.0  6.0       2.0
106   1.0   1.0  2.0       1.0
107   4.0   4.0  5.0       6.0

In [150]:
df.corr()

               age  py-score
age       1.000000  0.369871
py-score  0.369871  1.000000

In [153]:
df.corrwith(df)

age         1.0
py-score    1.0
dtype: float64

In [154]:
df_n

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [155]:
df_n.dropna(axis=1,how='any',inplace=False)

    name  age     sex
1   john   27    Male
2  marie   22  Female
3   luna   24  Female
4  peter   29    Male

In [156]:
df_n.dropna(axis=1,how='all',inplace=False)

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [157]:
df_n.drop_duplicates()

    name  age     sex married
1   john   27    Male     NaN
2  marie   22  Female     NaN
3   luna   24  Female     Yes
4  peter   29    Male      No

In [158]:
df_n.dropna()

    name  age     sex married
3   luna   24  Female     Yes
4  peter   29    Male      No

In [159]:
df_n.fillna(0)

    name  age     sex married
1   john   27    Male       0
2  marie   22  Female       0
3   luna   24  Female     Yes
4  peter   29    Male      No

In [160]:
df_n.fillna({'married':'Yes'})

    name  age     sex married
1   john   27    Male     Yes
2  marie   22  Female     Yes
3   luna   24  Female     Yes
4  peter   29    Male      No

In [164]:
df_n.loc[[2,3],['name','married']]

    name married
2  marie     NaN
3   luna     Yes

In [165]:
df_n.loc[:,['name']]

    name
1   john
2  marie
3   luna
4  peter

In [166]:
df_n['name']

1     john
2    marie
3     luna
4    peter
Name: name, dtype: object

In [169]:
df_n.loc[3,:]

name         luna
age            24
sex        Female
married       Yes
Name: 3, dtype: object

In [171]:
df_n.loc[1:2,['age','name']]
# label-based slicing with loc
# 1:2 both include

   age   name
1   27   john
2   22  marie

In [175]:
df_n.iloc[:2,[2,1]]
# interfer-based slicing with iloc
# 1:2  only 1 include

      sex  age
1    Male   27
2  Female   22

In [181]:
df_n.iloc[:,:3]

    name  age     sex
1   john   27    Male
2  marie   22  Female
3   luna   24  Female
4  peter   29    Male

In [188]:
df_n.iloc[[1,3,2],[2,1]]

      sex  age
2  Female   22
4    Male   29
3  Female   24

In [195]:
ser=pd.Series(np.random.rand(8),index=[['white','white','white','blue','blue','red','red','red']
        ,[1,2,3,1,2,1,2,3]])

In [196]:
ser

white  1    0.716134
       2    0.105114
       3    0.921498
blue   1    0.953099
       2    0.356894
red    1    0.031795
       2    0.806173
       3    0.930170
dtype: float64

In [197]:
ser['white']

1    0.716134
2    0.105114
3    0.921498
dtype: float64

In [200]:
ser[:,1]

white    0.716134
blue     0.953099
red      0.031795
dtype: float64

In [201]:
ser.loc[:,[1,2]]

white  1    0.716134
blue   1    0.953099
red    1    0.031795
white  2    0.105114
blue   2    0.356894
red    2    0.806173
dtype: float64